{
    "lore.mynethersdelight.bullet_pepper": "A spicy pepper harvested from Powdery Flowers.",
    "lore.mynethersdelight.bullet_pepper_crate": "A storage block full of Bullet Peppers.",
    "lore.mynethersdelight.cold_striderloaf_block": "A feast block that will take away your appetite.",
    "lore.mynethersdelight.crimson_fungus_colony": "A Nether Fungus that formed a colony when on top of Resurgent Soil.",
    "lore.mynethersdelight.ghasta_with_cream_block": "A feast block made of Ghast that slowly regenerates, as long as there's enough left.",
    "lore.mynethersdelight.hoglin_trophy": "A block celebrating the successful hunting of a Hoglin.",
    "lore.mynethersdelight.letios_compost": "A natural block that forgots in flame into Resurgent Soil.",
    "lore.mynethersdelight.magma_cake": "A delicious Cake, though it's quite a firestarter. Place it into the world to eat it up to seven times.",
    "lore.mynethersdelight.nether_stove": "A heat-emitting block that is even more suited for cooking food than a Campfire.",
    "lore.mynethersdelight.powdery_block": "A block of solid Powdery Cane. This can be made into Powdery Planks.",
    "lore.mynethersdelight.powdery_cane": "An invasive crop in Crimson Forests. Its Berries are explosive on contact, try cutting the red stem.",
    "lore.mynethersdelight.powdery_cannon": "A block that can be used to craft TNT or Powdery Blocks.",
    "lore.mynethersdelight.powdery_chubby_sapling": "A block that can be used to craft TNT or Powdery Blocks.",
    "lore.mynethersdelight.powdery_mosaic": "A decorative block that can be used for darker builds.",
    "lore.mynethersdelight.powdery_torch": "A block that can be used to light up your world so monsters don't spawn.",
    "lore.mynethersdelight.resurgent_soil": "A fertile and more durable Farmland that almost every crop feels comfortable in.",
    "lore.mynethersdelight.resurgent_soil_farmland": "A fertile and more durable Farmland that almost every crop feels comfortable in. Moisten with Fire, not Water!",
    "lore.mynethersdelight.skoglin_trophy": "A block celebrating the successful hunting of a Skoglin.",
    "lore.mynethersdelight.striderloaf_block": "A feast block that will take away your appetite, if allowed to cool first.",
    "lore.mynethersdelight.stripped_powdery_block": "A Powdery Cane Block that has had its bark removed with an axe.",
    "lore.mynethersdelight.stuffed_hoglin": "A feast block consisting of an entire Hoglin, stuffed with Fungus, Nether Salad, and spices. You'll eat on this for weeks!",
    "lore.mynethersdelight.warped_fungus_colony": "A Nether Fungus that formed a colony when on top of Resurgent Soil.",
    "lore.mynethersdelight.waxed_hoglin_trophy": "A block celebrating the successful hunting of a Hoglin.",
    "lore.mynethersdelight.zoglin_trophy": "A block celebrating the successful hunting of a Zoglin.",
    "lore.mynethersdelight.bleeding_tartar": "A basic meal made of Minced Strider and eggs.",
    "lore.mynethersdelight.blue_tenderloin_steak": "A saturating, yet hunger-inducing meal made of Cooked Hoglin Loin, Warped Fungus, and roots.",
    "lore.mynethersdelight.boiled_egg": "A basic meal that can be used for Egg Sandwiches and other larger meals.",
    "lore.mynethersdelight.breakfast_sampler": "A highly nourishing meal made from Roasted Sausage, Cooked Eggs, Bread, and Honey or Strider Eggs.",
    "lore.mynethersdelight.burnt_roll": "A meal made from meat and Magma Cream. Whatever works?",
    "lore.mynethersdelight.chilidog": "A nourishing meal made of minced meat, Nether Wart, and spices, added onto a Hotdog.",
    "lore.mynethersdelight.cooked_loin": "A cooked cut of meat from a Hoglin that can be used to make Blue Tenderloin Steak, and other meals.",
    "lore.mynethersdelight.crimson_stroganoff": "A highly nourishing meal made of Minced Strider, Crimson Fungus, milk, and pasta.",
    "lore.mynethersdelight.deviled_egg": "A basic meal made of a Boiled Egg, spices, and pork.",
    "lore.mynethersdelight.fried_hoglin_chop": "A highly nourishing, pungent meal made of Hoglin Loin, Wheat, milk, eggs, and a Bullet Pepper.",
    "lore.mynethersdelight.ghasmati": "A small cut of Ghasta, can be used as a rice substitute.",
    "lore.mynethersdelight.ghast_dough": "A dough substitute made from raw Ghast and eggs.",
    "lore.mynethersdelight.ghast_salad": "A meal made from raw Ghast, vegetables, and a Carrot.",
    "lore.mynethersdelight.ghasta": "A drop from Ghasts that can be used like Flour. Tastes like rice noodles.",
    "lore.mynethersdelight.hoglin_hide": "An item that serves as a source of leather, or a nice hunting trophy. Requires a Knife to harvest.",
    "lore.mynethersdelight.hoglin_loin": "A large cut of meat from a Hoglin's back. Tastes better when smoked!",
    "lore.mynethersdelight.hoglin_sausage": "A small cut of Hoglin Loin that can be smelted into Cooked Sausage, perfect for Hot Dogs.",
    "lore.mynethersdelight.hot_cream": "A meal that burn outs all active effects, converting them into Fire Resistance and Pungent.",
    "lore.mynethersdelight.hot_cream_cone": "A meal that burns out an active effect, converting it to Fire Resistance and Pungent. Striders love it!",
    "lore.mynethersdelight.hot_wings": "A highly nourishing, pungent meal made from raw chicken, spices, and an onion. Served in a bowl!",
    "lore.mynethersdelight.hot_wings_bucket": "A pungent meal made from raw chicken, spices, and an onion. Served in a bucket!",
    "lore.mynethersdelight.hotdog": "A basic meal - roasted Hoglin sausage in a bun!",
    "lore.mynethersdelight.magma_cake_slice": "A slice of Magma Cake cut with a Knife.",
    "lore.mynethersdelight.minced_strider": "A piece of Strider meat sliced thin, it tastes better this way.",
    "lore.mynethersdelight.plate_of_cold_striderloaf": "Plate of Cold Striderloaf",
    "lore.mynethersdelight.plate_of_ghasta_with_cream": "Plate of Ghasta with Cream",
    "lore.mynethersdelight.plate_of_striderloaf": "A meal that takes away your appetite.",
    "lore.mynethersdelight.plate_of_stuffed_hoglin": "A nourishing meal - part of a Stuffed Hoglin.",
    "lore.mynethersdelight.plate_of_stuffed_hoglin_ham": "A highly nourishing meal - part of a Stuffed Hoglin.",
    "lore.mynethersdelight.plate_of_stuffed_hoglin_snout": "A highly nourishing meal - part of a Stuffed Hoglin.",
    "lore.mynethersdelight.raw_stuffed_hoglin": "The centerpiece of a Stuffed Hoglin, ready to be stuffed.",
    "lore.mynethersdelight.roast_ear": "A small piece of a Stuffed Hoglin.",
    "lore.mynethersdelight.roasted_sausage": "A meat that restores more saturation than Hoglin Sausge.",
    "lore.mynethersdelight.rock_soup": "A meal made of Strider Eggs and Magma Cream.",
    "lore.mynethersdelight.sausage_and_potatoes": "A filling meal consisting of Hoglin Sausages and a potato.",
    "lore.mynethersdelight.spicy_cotton": "A meal consisting of spices and Ghasta, eaten off a Blaze Rod - the Nether's cotton candy.",
    "lore.mynethersdelight.spicy_curry": "A highly nourishing, pungent meal consisting of raw meat, milk, spices, rice, vegetables, and pumpkin. ",
    "lore.mynethersdelight.spicy_hoglin_stew": "A highly nourishing, pungent meal consisting of Hoglin meat, a Potato, Carrot, and Bullet Pepper.",
    "lore.mynethersdelight.spicy_noodle_soup": "A highly nourishing meal consisting of Ghasta, a cooked egg, spices, and raw Hoglin.",
    "lore.mynethersdelight.spicy_skewer": "A filling, if spicy, meal: raw strider and peppers skewered with a Blaze Rod.",
    "lore.mynethersdelight.strider_egg": "An egg obtained through careful hunting. Its hard shell ensures that it can only be eaten starry...",
    "lore.mynethersdelight.strider_rock": "A tough rock that can only be punctured with a Pickaxe on a Cutting Board.",
    "lore.mynethersdelight.strider_slice": "A cut of meat from a Strider. It's not very appetizing on its own.",
    "lore.mynethersdelight.strider_stew": "A simple stew featuring strider meat, fungus, and nether roots.",
    "lore.mynethersdelight.strider_with_grilled_fungus": "A filling meal featuring strider meat, Crimson and Warped Fungi and mushrooms."
  }